package LEC21;



class Tank1 extends Thread{
    public void run(){
        String str = new String();
        str = "श्री रामचन्द्र कृपालु भजुमन\n" +
                "हरण भवभय दारुणं ।\n" +
                "नव कंज लोचन कंज मुख\n" +
                "कर कंज पद कंजारुणं ॥१॥\n" +
                "\n" +
                "कन्दर्प अगणित अमित छवि\n" +
                "नव नील नीरद सुन्दरं ।\n" +
                "पटपीत मानहुँ तडित रुचि शुचि\n" +
                "नोमि जनक सुतावरं ॥२॥\n" +
                "\n" +
                "भजु दीनबन्धु दिनेश दानव\n" +
                "दैत्य वंश निकन्दनं ।\n" +
                "रघुनन्द आनन्द कन्द कोशल\n" +
                "चन्द दशरथ नन्दनं ॥३॥\n" +
                "\n" +
                "शिर मुकुट कुंडल तिलक\n" +
                "चारु उदारु अङ्ग विभूषणं ।\n" +
                "आजानु भुज शर चाप धर\n" +
                "संग्राम जित खरदूषणं ॥४॥" +
                "इति वदति तुलसीदास शंकर\n" +
                "शेष मुनि मन रंजनं ।\n" +
                "मम् हृदय कंज निवास कुरु\n" +
                "कामादि खलदल गंजनं ॥५॥\n" +
                "\n" +
                "मन जाहि राच्यो मिलहि सो\n" +
                "वर सहज सुन्दर सांवरो ।\n" +
                "करुणा निधान सुजान शील\n" +
                "स्नेह जानत रावरो ॥६॥\n" +
                "\n" +
                "एहि भांति गौरी असीस सुन सिय\n" +
                "सहित हिय हरषित अली।\n" +
                "तुलसी भवानिहि पूजी पुनि-पुनि\n" +
                "मुदित मन मन्दिर चली ॥७॥\n" +
                "\n" +
                "॥सोरठा॥\n" +
                "जानी गौरी अनुकूल सिय\n" +
                "हिय हरषु न जाइ कहि ।\n" +
                "मंजुल मंगल मूल वाम\n" +
                "अङ्ग फरकन लगे।";

        try{
            for(char ch : str.toCharArray()){
                System.out.print(ch);
                Thread.sleep(200);
            }

        }catch(Exception e){
        }
    }
}



public class Main6 {
    public static void main(){
        Tank1 t1 = new Tank1();
        t1.start();

    }
}
